{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задание 19.  \n",
    "Два игрока, Петя и Ваня, играют в следующую игру.  \n",
    "Перед игроками лежит куча камней.  \n",
    "Игроки ходят по очереди, первый ход делает Петя.  \n",
    "За один ход игрок может добавить в кучу два камня, добавить в кучу три камня или увеличить количество камней в куче в два раза.  \n",
    "Например, имея кучу из 15 камней, за один ход можно получить кучу из 17, 18 или 30 камней.  \n",
    "У каждого игрока, чтобы делать ходы, есть неограниченное количество камней.  \n",
    "Игра завершается в тот момент, когда количество камней в куче становится не менее 30.  \n",
    "Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 30 или больше камней.  \n",
    "В начальный момент в куче было S камней, 1 ≤ S ≤ 29.  \n",
    "Найдите минимальное значение S, при котором Ваня выигрывает своим первым ходом при любой игре Пети?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Если в начальный момент в куче 7 камней, то можно выиграть за 3 ход(а)\n",
      "Если в начальный момент в куче 8 камней, то можно выиграть за 4 ход(а)\n",
      "Если в начальный момент в куче 9 камней, то можно выиграть за 4 ход(а)\n",
      "Если в начальный момент в куче 10 камней, то можно выиграть за 3 ход(а)\n",
      "Если в начальный момент в куче 11 камней, то можно выиграть за 3 ход(а)\n",
      "Если в начальный момент в куче 12 камней, то можно выиграть за 3 ход(а)\n",
      "Если в начальный момент в куче 13 камней, то можно выиграть за 2 ход(а)\n",
      "Если в начальный момент в куче 14 камней, то можно выиграть за 2 ход(а)\n",
      "Если в начальный момент в куче 15 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 16 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 17 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 18 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 19 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 20 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 21 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 22 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 23 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 24 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 25 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 26 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 27 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 28 камней, то можно выиграть за 1 ход(а)\n",
      "Если в начальный момент в куче 29 камней, то можно выиграть за 1 ход(а)\n"
     ]
    }
   ],
   "source": [
    "# Функция проверяет, можно ли выиграть за moves ходов\n",
    "def f(s, move, moves):\n",
    "\n",
    "    # Если игра окончена, то ход move должен иметь ту же четность, что и moves\n",
    "    if s >= 30: return move%2 == moves%2\n",
    "\n",
    "    # Если игра  не окончилась за moves ходов, то мы отбрасываем эти варианты\n",
    "    if move == moves: return 0\n",
    "\n",
    "    # Строим список следующих ходов\n",
    "    move += 1\n",
    "    h = [f(s+2, move, moves), \n",
    "         f(s+3, move, moves), \n",
    "         f(s*2, move, moves)]\n",
    "\n",
    "    # Если это ход выигрывающего игрока, то достаточно победы в одном из вариантов,\n",
    "    # иначе должны подходить все варианты (победа во всех вариантах)\n",
    "    return any(h) if move%2 == moves%2 else all(h)\n",
    "\n",
    "\n",
    "for s in range(1, 30):\n",
    "    for moves in range(1,5): # достаточно от 1 до 5, так как глубина игры до 4 ходов\n",
    "        if f(s, 0, moves) == 1:\n",
    "            print(f\"Если в начальный момент в куче {s} камней, то можно выиграть за {moves} ход(а)\")\n",
    "            break  # если нашлась выигрышная стратегия \n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ответ: 13"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.5"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "e876daec862956c32cdb8efc282e3454978d221baa9883ca36b8b1a1935f01d6"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
