{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 18 (повышенный уровень, время – 6 мин)  \n",
        "Тема:  Динамическое программирование  \n",
        "Что проверяется:  \n",
        "Умение обрабатывать вещественные выражения в электронных таблицах.  \n",
        "3.4.3. Использование инструментов решения статистических и расчётно-графических задач.   \n",
        "1.1.2. Умение представлять и анализировать табличную информацию в виде графиков и диаграмм.  \n",
        "Что нужно знать:  \n",
        "•\tв задачах, которые предлагаются в этом задании КИМ, нужно найти оптимальный путь для Робота, который перемещается на клетчатом поле. Робот может на каждом шаге выбирать одно из двух направлений движения (например, только вправо и вниз).  \n",
        "•\tв каждой клетке Робот получает некоторую награду («берёт монету»), и нужно найти такой путь, при котором общая награда будет наибольшая (или наименьшая, если это не награда, а штраф)  \n",
        "•\tконечно, теоретически можно решить такую задачу полным перебором вариантов: рассмот-реть все возможные пути и выбрать лучший. Однако количество возможных путей для полей даже не очень большого размера слишком велико для того, чтобы решить эту задачу за вре-мя проведения ЕГЭ, даже если вам удастся безошибочно написать программу для такого пе-ребора.  \n",
        "•\tэта задача успешно и быстро решается с помощью динамического программирования – ме-тода оптимизации, который предложил американский математик Ричард Беллман. Он сфор-мулировал очень простой принцип оптимальности пути: любая часть оптимального пути оп-тимальна.  \n",
        "\n",
        "---\n",
        "Р-00 (демо-2021). Квадрат разлинован на N×N клеток (1 < N < 17). Исполнитель Робот может пе-ремещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз – в сосед-нюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым за-пуском Робота в каждой клетке квадрата лежит монета достоинством от 1 до 100. Посетив клет-ку, Робот забирает монету с собой; это также относится к начальной и конечной клетке маршру-та Робота. Определите максимальную и минимальную денежную сумму, которую может со-брать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответе укажите два числа – сначала максимальную сумму, затем минимальную.  \n",
        "Исходные данные записаны в файле 18-0.xls в виде электронной таблице размером N×N, каждая ячейка которой соответствует клетке квадрата.\n",
        "```\n",
        "Решение (программа):\n",
        "1)\tв наборе файлов к этому заданию должен быть файл с расширением .csv (англ. comma separated values – значения, разделённые запятыми); чаще всего в качестве разделителя используется точка с запятой; если такого файла нет, его можно всегда получить, сохранив электронную таблицу в формате CSV; в данной задаче файл 18-0.csv выглядит так:\n",
        "51;21;93;48;45;100;67;39;18;29\n",
        "57;43;97;51;92;10;93;32;19;58\n",
        "63;16;31;16;78;88;90;72;37;67\n",
        "10;57;64;25;96;50;81;65;91;69\n",
        "99;43;95;7;40;76;18;34;5;65\n",
        "35;19;71;77;64;38;62;56;10;2\n",
        "100;57;27;26;51;33;100;11;53;1\n",
        "11;79;49;46;37;69;80;31;25;39\n",
        "22;71;20;23;11;12;39;16;64;34\n",
        "4;25;87;84;30;48;77;13;40;33\n",
        "2)\tнапишем программу на языке Python, поскольку на других языках она получится значитель-но сложнее и использование такого подхода становится, мягко говоря, не очень обоснован-но \n",
        "3)\tсначала читаем данные из файла в матрицу (двухмерный массив) data, попутно определя-ем размеры матрицы: число строк N и число столбцов M:\n",
        "data = []\n",
        "for s in open( \"18-0.csv\" ):\n",
        "  row = list( map( int, s.split(';') ) )\n",
        "  data.append( row )\n",
        "N = len( data )\n",
        "M = len( data[0] )\n",
        "4)\tстроим рабочую матрицу такого же размера, что и исходная; заполняем её нулями:\n",
        "work = [ [0]*M for i in range(N) ]\n",
        "5)\tзаполняем ячейку в правом нижнем углу (конечная точка маршрута Робота); учитываем, что нумерация строк и столбцов матрицу в Python начинается с нуля, так что эта ячейка имеет индексы N-1, M-1:\n",
        "work[N-1][M-1] = data[N-1][M-1]\n",
        "6)\tзаполняем последнюю строку (с индексом N-1) справа налево:\n",
        "for col in range(M-2,-1,-1):\n",
        "  work[N-1][col] = data[N-1][col] + work[N-1][col+1]\n",
        "7)\tзаполняем последний столбец (с индексом M-1) снизу вверх:\n",
        "for row in range(N-2,-1,-1):\n",
        "  work[row][M-1] = data[row][M-1] + work[row+1][M-1]\n",
        "8)\tзаполняем центральную часть (сверху вниз, справа налево):\n",
        "for row in range(N-2,-1,-1):\n",
        "  for col in range(M-2,-1,-1):\n",
        "     work[row][col] = data[row][col] + \\\n",
        "           max(work[row][col+1], work[row+1][col])\n",
        "в данном случае программа будет искать максимальную сумму; для поиска минимальной суммы нужно заменить функцию max на min\n",
        "9)\tостаётся вывести ответ – значение левого верхнего угла рабочей матрицы work, то есть значение ячейки с нулевыми индексами:\n",
        "print( work[0][0] )\n",
        "\n",
        "```\n",
        "Ответ: 1204"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 8,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "1204\n"
          ]
        }
      ],
      "source": [
        "data = [list(map(int, s.split(';'))) for s in open(\"DATA/18-0.csv\")]\n",
        "rows = len(data)\n",
        "cols = len(data[0])\n",
        "\n",
        "work = data\n",
        "\n",
        "for col in range(cols-2,-1,-1):\n",
        "  work[rows-1][col] = data[rows-1][col] + work[rows-1][col+1]\n",
        "\n",
        "for row in range(rows-2,-1,-1):\n",
        "  work[row][cols-1] = data[row][cols-1] + work[row+1][cols-1]\n",
        "\n",
        "for row in range(rows-2,-1,-1):\n",
        "  for col in range(cols-2,-1,-1):\n",
        "     work[row][col] = data[row][col] + max(work[row][col+1], work[row+1][col])\n",
        "\n",
        "print(work[0][0])"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "interpreter": {
      "hash": "0c7e3f9b820683b5df7b59d11409c6edcbcaa278ffcb0312f5423ba0ba992d7e"
    },
    "kernelspec": {
      "display_name": "Python 3.9.2 64-bit",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
