{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 17 (повышенный уровень, время – 14 мин)  \n",
        "Тема:  Перебор последовательности целых чисел. Проверка делимости  \n",
        "\n",
        "Что проверяется: Умение создавать собственные программы (20–40 строк) для обработки целочисленной информации.  \n",
        "1.7.2. Основные конструкции языка программирования. Система программирования.  \n",
        "1.1.5. Умение создавать программы на языке программирования по их описанию.  \n",
        "\n",
        "Что нужно знать:  \n",
        "•\tв известных задачах этого типа (не олимпиадных) нет ограничения на время выполнения, по крайней мере, оно несущественно для отрезков, заданных для перебора; поэтому можно использовать простой перебор без оптимизации;  \n",
        "•\tзадачи этого типа предлагается решать с помощью электронных таблиц или собственной программы; как правило, написать правильную программу значительно проще  \n",
        "\n",
        "\n",
        "---\n",
        "33)\t(А. Куканова)  \n",
        "\n",
        "Рассматривается множество целых чисел, принадлежащих числовому отрезку [1000; 9999], которые удовлетворяют следующим условиям:  \n",
        "− не делятся нацело на 5, 7 и 11;  \n",
        "− запись в троичной системе счисления имеет ровно 8 цифр.  \n",
        "\n",
        "Найдите минимальное и максимальное из этих чисел."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 11,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "2187 6558\n"
          ]
        }
      ],
      "source": [
        "num = [n for n in range(1000, 9999+1) if (3**7 <= n <= 3**8-1) and n%5 and n%7 and n%11]\n",
        "\n",
        "print(min(num), max(num))\n"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
