{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 26 (высокий уровень, время – 35 минут)  \n",
        "\n",
        "Тема: Обработка массива целых чисел из файла. Сортировка.  \n",
        "\n",
        "Что проверяется: Умение обрабатывать целочисленную информацию с использованием сортировки.\n",
        "\n",
        "---\n",
        "21\t(А.М. Кабанов, г. Тольятти)  \n",
        "В магазине электроники раз в месяц проводится распродажа. Из всех товаров выбирают K товаров с самой большой ценой и делают на них скидку в 20%. По заданной информации о цене каждого из товаров и количестве товаров, на которые будет скидка, определите цену самого дорогого товара, не участвующего в распродаже, а также целую часть от суммы всех скидок.  \n",
        "\n",
        "Входные и выходные данные.  \n",
        "В первой строке входного файла 26-k1.txt находятся два числа, записанные через пробел: N – общее количество цен (натуральное число, не превышающее 10 000) и K – количество товаров со скидкой. В следующих N строках находятся значения цены каждого из товаров (все числа натуральные, не превышающие 10 000), каждое в отдельной строке.  Запишите в ответе два числа: сначала цену самого дорогого товара, не участвующего в распродаже, а затем целую часть от суммы всех скидок.\n",
        "```\n",
        "Пример входного файла: \n",
        "10 3\n",
        "1800\n",
        "3600\n",
        "3700\n",
        "800\n",
        "2600\n",
        "2500\n",
        "1800\n",
        "1500\n",
        "1900\n",
        "1200\n",
        "```\n",
        "При таких исходных данных ответ должен содержать два числа – 2500 и 1980. Пояснение: скидка будет на товары стоимостью 3700, 3600, 2600. Тогда самый дорогой товар без скидки стоит 2500, а сумма скидок 740+720+520 = 1980."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 31,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "9000 190680.0\n"
          ]
        }
      ],
      "source": [
        "with open('DATA/26-k1.txt') as file:\n",
        "    N, K = map(int, file.readline().split())\n",
        "    data = [int(file.readline()) for _ in range(N)]\n",
        "\n",
        "data.sort(reverse=True)\n",
        "\n",
        "print(data[K], sum(data[:K])*0.2)\n"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
