{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 25 (высокий уровень, время – 20 минут)  \n",
        "\n",
        "Тема: Обработка целых чисел. Проверка делимости  \n",
        "\n",
        "Что проверяется:\n",
        "Умение создавать собственные программы (10–20 строк) для обработки целочисленной информации.\n",
        "- 1.5.2.  Цепочки (конечные последовательности), деревья, списки, графы, матрицы (массивы), псевдослучайные последовательности (?).\n",
        "- 1.1.3. Строить информационные модели объектов, систем и процессов в виде алгоритмов.  \n",
        "\n",
        "Что нужно знать:\n",
        "- в известных задачах этого типа (не олимпиадных) нет ограничения на время выполнения, по крайней мере, оно несущественно для отрезков, заданных для перебора; поэтому можно использовать простой перебор без оптимизации;\n",
        "- задачи этого типа предлагается решать с электронных таблиц или собственной программы; как правило, написать правильную программу значительно проще\n",
        "- особенности языка Python: (В. Ялдыгин) при записи больших чисел в Python можно использовать знаки подчеркивания; например, 7_777_777 обозначает то же самое, что и 7777777.\n",
        "---\n",
        "> Р-03. Найдите все натуральные числа, принадлежащие отрезку [77 777 777; 88 888 888], у которых ровно пять различных нечётных делителей (количество чётных делителей может быть любым). В ответе перечислите найденные числа, справа от каждого числа запишите его наименьший нечётный делитель, не равный 1.\n",
        "\n",
        "Решение (программа перебирает числа из отрезка, разбор – В.Н. Шубинкин)\n",
        "1)\tОтметим, что простой перебор (решение «в лоб») для такой задачи будет работать порядка 20 минут, что неприемлемо в условиях экзамена.\n",
        "2)\tЧтобы написать эффективный алгоритм, обратимся к математике. Известно, что любое число единственным образом (с точностью до порядка сомножителей) представимо в виде произведения простых чисел.\n",
        "3)\tВсе делители числа (кроме 1) можно получить, взяв произведения всевозможных комбинаций простых множителей.\n",
        "4)\tРассмотрим случай, когда в разложение числа на простые множители входит ровно два простых нечётных числа каждое в первой степени. Тогда число n делится на 1, $p_1, p_2$ и произведение $p_1 \\cdot p_2$, т.е. имеет 4 нечётных делителя. Такой случай нам не подходит.\n",
        "5)\tПопробуем взять одно из простых чисел во второй степени. Тогда нечётными делителями числа n будут: 1, $p_1, p_2, p_1^2, p_1 \\cdot p_2, p_1^2 \\cdot p_2$. Это уже 6 делителей. Очевидно, что при увеличении количества нечётных простых делителей мы также получим больше 5 нечётных делителей исходного числа.\n",
        "6)\tСделаем ключевой для решения задачи вывод: <mark>если число имеет ровно 5 нечётных делителей, в его разложение на простые множители может входить только 1 нечётное простое число.</mark> Тогда этими делителями будут 1, $p, p^2, p^3, p^4$.\n",
        "7)\tЗадача свелась к тому, чтобы перебрать числа из отрезка и, убрав из их разложения на простые множители $2^k$, определить является ли то, что осталось четвёртой степенью простого числа. Наименьшим простым нечётным делителем, отличным от единицы, будет это простое число. Для определения простоты числа воспользуемся вариантом функции isPrime() без вещественных чисел."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 6,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "77900162 79\n",
            "78074896 47\n",
            "78675968 7\n",
            "80604484 67\n",
            "81920000 5\n",
            "84934656 3\n",
            "85525504 17\n",
            "88529281 97\n"
          ]
        }
      ],
      "source": [
        "from math import sqrt\n",
        "\n",
        "# функция для определения простоты числа\n",
        "def isPrime(x):\n",
        "    if x==2 or x==3:\n",
        "        return True\n",
        "    if x%2==0 or x<2:\n",
        "        return False\n",
        "    for i in range(3, int(sqrt(x)+1), 2):\n",
        "        if x%i==0:\n",
        "            return False\n",
        "    return True\n",
        "    \n",
        "for n in range(77777777, 88888888+1):\n",
        "    x = n\n",
        "    # убираем из разложения числа x на простые множители все двойки\n",
        "    while x % 2 == 0:\n",
        "        x //= 2\n",
        "    # находим корень четвёртой степени из того, что осталось\n",
        "    qX = round(sqrt(sqrt(x)))\n",
        "    # проверяем, является ли x четвёртой степенью простого числа\n",
        "    if isPrime(qX) and qX**4 == x:\n",
        "        print( n, qX )\n"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
