{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 22\n",
        "\n",
        "P-08. Получив на вход число x, этот алгоритм печатает число M. Известно, что x > 100. Укажите наименьшее такое (т.е. большее 100) число x, при вводе которого алгоритм печатает 26.  \n",
        "```\n",
        "x = int(input())\n",
        "L = x\n",
        "M = 65\n",
        "if L % 2 == 0:  M = 52\n",
        "while L != M:\t# * \n",
        "    if L > M:   \t# * \n",
        "        L -= M    \t# * \n",
        "    else:\t# * \n",
        "        M -= L\t# * \n",
        "print(M)  \n",
        "```\n",
        "**Решение:**\n",
        "1)\tвидим, что в последней строке выводится на экран переменная M\n",
        "2)\t*ключевой момент решения: нужно узнать в строках программы, отмеченных знаком * в комментариях, АЛГОРИТМ ЕВКЛИДА для вычисления наибольшего общего делителя (НОД) чисел, записанный в переменные M и L*\n",
        "3)\t введённое значение x записывается в переменную L и участвует в поиске НОД\n",
        "4)\tв переменную M до начала цикла записывается 65, но если было введено чётное (L % 2 = 0) значение x (оно же L), значение M заменяется на 52\n",
        "5)\tсначала предположим, что замены не было, и в M осталось значение 65; поскольку по условию алгоритм печатает 26, тогда получается, что НОД(x,65)=26; этого явно не может быть, потому что 65 не делится на 26\n",
        "6)\tделаем вывод, что введено чётное значение x и произошла замена M на 52\n",
        "7)\tитак, нужно найти чётное число x, большее 100, такое, что НОД(x,52)=26\n",
        "8)\tпервое число, большее 100, которое делится на 26 – это 104, но оно не подходит, потому что делится ещё и на 52, так что НОД(x,52)=52\n",
        "9)\tпоэтому берём следующее число, которое делится на 26: 104 + 26 = 130\n",
        "10)\tОтвет: 130.\n",
        "\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "130\n"
          ]
        }
      ],
      "source": [
        "def LM(x):\n",
        "    # x = int(input())\n",
        "    L = x\n",
        "    M = 65\n",
        "    if L % 2 == 0:  M = 52\n",
        "    while L != M:\t# * \n",
        "        if L > M:   \t# * \n",
        "            L -= M    \t# * \n",
        "        else:\t# * \n",
        "            M -= L\t# * \n",
        "    # print(M)\n",
        "    return M\n",
        "\n",
        "x = 101\n",
        "while LM(x) != 26:\n",
        "    x += 1\n",
        "print(x)"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
