{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 23 (повышенный уровень, время – 8 мин)\n",
        "\n",
        "**Тема:**  \n",
        "Динамическое программирование  \n",
        "\n",
        "**Что проверяется:**  \n",
        "Умение анализировать результат исполнения алгоритма*  \n",
        "- 1.6.2. Вычислимость. Эквивалентность алгоритмических моделей (?).  \n",
        "- 1.1.3. Умение строить информационные модели объектов, систем и процессов в виде алгоритмов (?).\n",
        "\n",
        "**Что нужно знать:**  \n",
        "-\tдинамическое программирование – это способ решения сложных задач путем сведения их к более простым задачам того же типа  \n",
        "-\tс помощью динамического программирования решаются задачи, которые требуют полного перебор вариантов:  \n",
        "    -\t«подсчитайте количество вариантов…»  \n",
        "    -\t«как оптимально распределить…»  \n",
        "    -\t«найдите оптимальный маршрут…»  \n",
        "-\tдинамическое программирование позволяет ускорить выполнение программы за счет использования дополнительной памяти; полный перебор не требуется, поскольку запоминаются решения всех задач с меньшими значениями параметров"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "3038d883",
      "metadata": {},
      "source": [
        "Р-07. Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:\n",
        "1. Прибавить 1\n",
        "2. Умножить на 2  \n",
        "\n",
        "Первая команда увеличивает число на экране на 1, вторая умножает его на 2. Программа для исполнителя – это последовательность команд. Сколько существует программ, для которых при исходном числе 2 результатом является число 29 и при этом траектория вычислений содержит число 14 и не содержит числа 25?"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 26,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "13\n"
          ]
        }
      ],
      "source": [
        "# Решение (программа на Python, Б.С. Михлин):\n",
        "def F(x, target):\n",
        "    '''\n",
        "    Функция подсчета количества цепочек команд (программ)\n",
        "    x - текущее число, target - цель\n",
        "    '''\n",
        "    if x == target:                         # если цель достигнута, то\n",
        "        return 1                            # завершить функцию, посчитав цепочку (программу)\n",
        "    if x > target:                          # если перелет, то\n",
        "        return 0                            # завершить функцию, не считая цепочку\n",
        "    return F(x+1, target) + F(x*2, target)  # продолжаем строить дерево\n",
        "    \n",
        "print(F(2, 14) * F(14, 29) - F(2, 14) * F(14, 25) * F(25, 29))"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
