{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "statistical-dispute",
      "metadata": {
        "id": "statistical-dispute"
      },
      "source": [
        "## Задание 27 (высокий уровень, время – 35 мин)  \n",
        "\n",
        "Тема: Обработка данных, вводимых из файла в виде последовательности чисел.  \n",
        "\n",
        "Что проверяется:  \n",
        "Умение создавать собственные программы (20–40 строк) для анализа числовых последовательностей.  \n",
        "\n",
        "1.6.3. Построение алгоритмов и практические вычисления.  \n",
        "1.1.3. Строить информационные модели объектов, систем и процессов в виде алгоритмов.  \n",
        "\n",
        "Что нужно знать:  \n",
        "•\tкак прочитать данные из файла  \n",
        "•\tосновы комбинаторики  \n",
        "•\tдинамическое программирование  \n",
        "\n",
        "Благодаря тому, что в компьютерном ЕГЭ само решение не проверяется и основной задачей становится получение правильного ответа, скорее всего не будет задач 27, которые можно решить переборными алгоритмами с квадратичной сложностью (оценка O(n2)). Задача 27 в демо-варианте КИМ даёт представление и типе задач, которые такими алгоритмами не решаются. Вероятно, будут предложены задачи, в которых полный перебор вариантов имеет сложность O(2N) или O(N!), однако использование динамического программирования позволяет быстро решить задачу за один проход.\n",
        "\n",
        "---\n",
        "Имеется набор данных, состоящий из пар положительных целых чисел. Необходимо выбрать из каждой пары ровно одно число так, чтобы сумма всех выбранных чисел не делилась на 3 и при этом была минимально возможной. Гарантируется, что искомую сумму получить можно. Программа должна напечатать одно число – минимально возможную сумму, соответствующую условиям задачи.  \n",
        "\n",
        "**Входные данные:** Даны два входных файла: файл A (27-1a.txt) и файл B (27-1b.txt), каждый из которых содержит в первой строке количество пар N (1 ≤ N ≤ 100000). Каждая из следующих N строк содержит два натуральных числа, не превышающих 10 000.  \n",
        "```\n",
        "Пример входного файла:\n",
        "6\n",
        "1 3\n",
        "5 12\n",
        "6 9\n",
        "5 4\n",
        "3 3\n",
        "1 1\n",
        "```\n",
        "\n",
        "Для указанных входных данных значением искомой суммы должно быть число 20.  \n",
        "В ответе укажите два числа: сначала значение искомой суммы для файла А, затем для файла B.  "
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 2,
      "id": "geological-excitement",
      "metadata": {
        "id": "geological-excitement",
        "outputId": "13b76506-f14d-4e0e-b13b-c97fd309cb3b"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "максимальная сумма для файла A 127127\n"
          ]
        }
      ],
      "source": [
        "sum_min_ab = 0\n",
        "min_dif = 999999\n",
        "\n",
        "with open('DATA/27-1a.txt') as file:\n",
        "    for _ in range(int(file.readline())):\n",
        "        a, b = map(int, file.readline().split())\n",
        "        sum_min_ab += max(a, b)\n",
        "        if abs(a-b) % 3:\n",
        "            min_dif = min(abs(a-b), min_dif)\n",
        "            \n",
        "if sum_min_ab % 3 == 0:\n",
        "    sum_min_ab -= min_dif\n",
        "print(f\"максимальная сумма для файла A {sum_min_ab}\")"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "include_colab_link": true,
      "name": "EGE-2021.ipynb",
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.2"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
